export const excelHeaderMap = [
  { title: '学籍号', key: 'cardId'},
  { title: '学号', key: 'classId'},
  { title: '姓名', key: 'name'},
  { title: '年龄', key: 'age'},
  { title: '年级', key: 'grade'},
  { title: '班级', key: 'classNum'},
  { title: '性别', key: 'sex'},
  { title: '类别', key: 'type'},
  { title: '手机号（非必填）', key: 'telPhone'},
  { title: '省份', key: 'province'},
  { title: '民族', key: 'nation'},
  { title: '家长知情同意（是/否）', key: 'known'},

  // 转换工具
  // { title: 'id', key: 'id'},
  // { title: '名称', key: 'name'},
  // { title: '形象', key: 'animal'},
  // { title: '色相', key: 'hue'},
  // { title: '色调', key: 'stripe'},
  // { title: '开放度', key: 'open'},
  // { title: '理性', key: 'sense'},
  // { title: '优势', key: 'person_1'},
  // { title: '弱势', key: 'person_2'},
  // { title: '建议1', key: 'person_3'},
  // { title: '学习特点', key: 'study_1'},
  // { title: '学习重点及技巧', key: 'study_2'},
  // { title: '建议2', key: 'study_3'},
  // { title: '沟通特点', key: 'communicate_1'},
  // { title: '建议3', key: 'communicate_2'},
  // { title: '人际情况及特点', key: 'interpersonal_1'},
  // { title: '建议4', key: 'interpersonal_2'},
  // { title: '内认同——外认同', key: 'rentong'},
  // { title: '理性——感性', key: 'lixing'},
  // { title: '个体——群体', key: 'geti'},
  // { title: '执行——幻想', key: 'zhixing'},
  // { title: '果断——谨慎', key: 'guoduan'},
  // { title: '现实——理想', key: 'xianshi'},
];

export const sixGradeMap = {
  "1": [
      4,
      7,
      7,
      -8,
      -3,
      8
  ],
  "2": [
      4,
      7,
      6,
      -9,
      -7,
      8
  ],
  "3": [
      3.5,
      7,
      5,
      -10,
      -9,
      8
  ],
  "4": [
      3,
      5,
      6,
      -7,
      -4,
      4
  ],
  "5": [
      3,
      5,
      5,
      -8,
      -8,
      4
  ],
  "6": [
      2.5,
      5,
      4,
      -9,
      -9,
      4
  ],
  "7": [
      4,
      -4,
      7,
      -9,
      -5,
      4
  ],
  "8": [
      4,
      -4,
      6,
      -9,
      -7,
      4
  ],
  "9": [
      3.5,
      -4,
      5,
      -10,
      -9,
      4
  ],
  "10": [
      5,
      -3,
      7,
      5,
      6,
      9
  ],
  "11": [
      5,
      -3,
      6,
      5,
      4,
      9
  ],
  "12": [
      4,
      -3,
      5,
      5,
      3,
      8
  ],
  "13": [
      7,
      8,
      7,
      7,
      6,
      10
  ],
  "14": [
      7,
      8,
      6,
      7,
      4,
      10
  ],
  "15": [
      6,
      8,
      5,
      7,
      3,
      10
  ],
  "16": [
      3,
      -5,
      7,
      -4,
      7,
      -5
  ],
  "17": [
      3,
      -5,
      6,
      -4,
      5,
      -5
  ],
  "18": [
      3.5,
      -5,
      5,
      -4,
      3,
      -5
  ],
  "19": [
      -4,
      0,
      0,
      -3,
      7,
      -4
  ],
  "20": [
      -4,
      0,
      -1,
      -3,
      5,
      -4
  ],
  "21": [
      -5,
      0,
      -2,
      -4,
      2,
      -4
  ],
  "22": [
      3,
      -6,
      6,
      -8,
      -6,
      2
  ],
  "23": [
      3,
      -6,
      5,
      -8,
      -8,
      2
  ],
  "24": [
      2.5,
      -6,
      4,
      -9,
      -10,
      2
  ],
  "25": [
      4,
      6,
      7,
      -3,
      6,
      -4
  ],
  "26": [
      4,
      6,
      6,
      -3,
      4,
      -4
  ],
  "27": [
      3.5,
      6,
      5,
      -3,
      2,
      -4
  ],
  "28": [
      7,
      3,
      10,
      -5,
      -1,
      3
  ],
  "29": [
      7,
      3,
      9,
      -5,
      -3,
      3
  ],
  "30": [
      6,
      3,
      8,
      -6,
      -5,
      3
  ],
  "31": [
      6,
      -3,
      9,
      -6,
      -2,
      2
  ],
  "32": [
      6,
      -3,
      8,
      -6,
      -4,
      2
  ],
  "33": [
      5,
      -3,
      7,
      -7,
      -6,
      2
  ],
  "34": [
      1,
      -5,
      3,
      -9,
      -3,
      3
  ],
  "35": [
      1,
      -5,
      2,
      -9,
      -5,
      3
  ],
  "36": [
      0.5,
      -5,
      1,
      -10,
      -7,
      3
  ],
  "37": [
      2,
      5,
      4,
      -7,
      -5,
      5
  ],
  "38": [
      2,
      5,
      3,
      -8,
      -7,
      5
  ],
  "39": [
      1.5,
      5,
      2,
      -9,
      -9,
      5
  ],
  "40": [
      4,
      -3,
      4,
      5,
      7,
      6
  ],
  "41": [
      4,
      -3,
      3,
      5,
      5,
      6
  ],
  "42": [
      3,
      -3,
      2,
      5,
      4,
      6
  ],
  "43": [
      5,
      6,
      5,
      6,
      7,
      7
  ],
  "44": [
      5,
      6,
      4,
      6,
      5,
      7
  ],
  "45": [
      4,
      6,
      3,
      6,
      4,
      7
  ],
  "46": [
      -1,
      -7,
      2,
      -6,
      -7,
      -10
  ],
  "47": [
      -1,
      -7,
      1,
      -7,
      -9,
      -10
  ],
  "48": [
      -1.5,
      -7,
      0,
      -8,
      -10,
      -10
  ],
  "49": [
      0,
      -6,
      3,
      -4,
      8,
      -8
  ],
  "50": [
      0,
      -6,
      2,
      -4,
      6,
      -8
  ],
  "51": [
      -0.5,
      -6,
      1,
      -4,
      3,
      -8
  ],
  "52": [
      -1,
      3,
      3,
      -5,
      -3,
      -9
  ],
  "53": [
      -1,
      3,
      2,
      -6,
      -7,
      -9
  ],
  "54": [
      -1.5,
      3,
      1,
      -7,
      -8,
      -9
  ],
  "55": [
      0,
      4,
      4,
      -2,
      8,
      -7
  ],
  "56": [
      0,
      4,
      3,
      -2,
      6,
      -7
  ],
  "57": [
      -0.5,
      4,
      2,
      -2,
      3,
      -7
  ],
  "58": [
      10,
      5,
      10,
      4,
      8,
      5
  ],
  "59": [
      10,
      5,
      9,
      4,
      6,
      5
  ],
  "60": [
      9,
      5,
      8,
      4,
      5,
      5
  ],
  "61": [
      9,
      -1,
      9,
      5,
      8,
      4
  ],
  "62": [
      9,
      -1,
      8,
      5,
      6,
      4
  ],
  "63": [
      8,
      -1,
      7,
      5,
      5,
      4
  ],
  "64": [
      8,
      2,
      9,
      -3,
      -6,
      -7
  ],
  "65": [
      8,
      2,
      8,
      -4,
      -8,
      -7
  ],
  "66": [
      7,
      2,
      7,
      -5,
      -9,
      -7
  ],
  "67": [
      9,
      2,
      10,
      0,
      9,
      -5
  ],
  "68": [
      9,
      2,
      9,
      -1,
      7,
      -5
  ],
  "69": [
      8,
      2,
      8,
      -2,
      4,
      -5
  ],
  "70": [
      7,
      -4,
      8,
      -4,
      -4,
      -8
  ],
  "71": [
      7,
      -4,
      7,
      -5,
      -6,
      -8
  ],
  "72": [
      6,
      -4,
      6,
      -6,
      -7,
      -8
  ],
  "73": [
      8,
      -2,
      9,
      -1,
      8,
      -6
  ],
  "74": [
      8,
      -2,
      8,
      -2,
      6,
      -6
  ],
  "75": [
      7,
      -2,
      7,
      -3,
      3,
      -6
  ],
  "76": [
      -4,
      3,
      1,
      -7,
      -3,
      6
  ],
  "77": [
      -4,
      3,
      0,
      -7,
      -5,
      6
  ],
  "78": [
      -5,
      3,
      -1,
      -8,
      -6,
      6
  ],
  "79": [
      -3,
      -8,
      0,
      -8,
      -4,
      5
  ],
  "80": [
      -3,
      -8,
      -1,
      -8,
      -6,
      5
  ],
  "81": [
      -4,
      -8,
      -2,
      -9,
      -7,
      5
  ],
  "82": [
      -3,
      -7,
      -1,
      -4,
      6,
      -5
  ],
  "83": [
      -3,
      -7,
      -2,
      -4,
      4,
      -5
  ],
  "84": [
      -4,
      -7,
      -3,
      -5,
      1,
      -5
  ],
  "85": [
      -1,
      -3,
      -1,
      2,
      5,
      7
  ],
  "86": [
      -1,
      -3,
      -2,
      2,
      3,
      7
  ],
  "87": [
      -2,
      -3,
      -3,
      3,
      0,
      7
  ],
  "88": [
      -2,
      2,
      0,
      3,
      6,
      8
  ],
  "89": [
      -2,
      2,
      -1,
      3,
      4,
      8
  ],
  "90": [
      -3,
      2,
      -2,
      4,
      1,
      8
  ],
  "91": [
      -7,
      -10,
      -2,
      -7,
      -5,
      -8
  ],
  "92": [
      -7,
      -10,
      -3,
      -7,
      -7,
      -8
  ],
  "93": [
      -8,
      -10,
      -4,
      -8,
      -8,
      -8
  ],
  "94": [
      -8,
      1,
      -1,
      -6,
      -4,
      -7
  ],
  "95": [
      -8,
      1,
      -2,
      -6,
      -6,
      -7
  ],
  "96": [
      -9,
      1,
      -3,
      -7,
      -7,
      -7
  ],
  "97": [
      -6,
      8,
      -1,
      -4,
      -1,
      7
  ],
  "98": [
      -6,
      8,
      -2,
      -4,
      -3,
      7
  ],
  "99": [
      -7,
      8,
      -3,
      -5,
      -5,
      7
  ],
  "100": [
      -5,
      0,
      0,
      -5,
      -3,
      6
  ],
  "101": [
      -5,
      0,
      -1,
      -5,
      -5,
      6
  ],
  "102": [
      -6,
      0,
      -2,
      -6,
      -7,
      6
  ],
  "103": [
      -8,
      7,
      -6,
      3,
      9,
      -3
  ],
  "104": [
      -8,
      7,
      -7,
      3,
      7,
      -3
  ],
  "105": [
      -9,
      7,
      -8,
      4,
      4,
      -3
  ],
  "106": [
      -7,
      -1,
      -5,
      2,
      8,
      -4
  ],
  "107": [
      -7,
      -1,
      -6,
      2,
      6,
      -4
  ],
  "108": [
      -8,
      -1,
      -7,
      3,
      3,
      -4
  ],
  "109": [
      -5,
      10,
      -2,
      10,
      7,
      9
  ],
  "110": [
      -5,
      10,
      -3,
      10,
      5,
      9
  ],
  "111": [
      -6,
      10,
      -4,
      9,
      4,
      9
  ],
  "112": [
      -4,
      1,
      -1,
      9,
      6,
      8
  ],
  "113": [
      -4,
      1,
      -2,
      9,
      4,
      8
  ],
  "114": [
      -5,
      1,
      -3,
      8,
      3,
      8
  ],
  "115": [
      -9,
      6,
      -7,
      -3,
      0,
      -5
  ],
  "116": [
      -9,
      6,
      -8,
      -3,
      -2,
      -5
  ],
  "117": [
      -10,
      6,
      -9,
      -4,
      -4,
      -5
  ],
  "118": [
      -8,
      -2,
      -6,
      -4,
      -2,
      -6
  ],
  "119": [
      -8,
      -2,
      -7,
      -4,
      -4,
      -6
  ],
  "120": [
      -9,
      -2,
      -8,
      -5,
      -6,
      -6
  ],
  "121": [
      2,
      3,
      -6,
      7,
      -7,
      9
  ],
  "122": [
      2,
      3,
      -5,
      7,
      -8,
      9
  ],
  "123": [
      1.5,
      3,
      -4,
      7,
      -9,
      9
  ],
  "124": [
      2,
      -3,
      -7,
      6,
      -6,
      8
  ],
  "125": [
      2,
      -3,
      -6,
      6,
      -7,
      8
  ],
  "126": [
      1.5,
      -3,
      -5,
      6,
      -8,
      8
  ],
  "127": [
      -2,
      2,
      -5,
      6,
      -6,
      2
  ],
  "128": [
      -2,
      2,
      -4,
      6,
      -7,
      2
  ],
  "129": [
      -2.5,
      2,
      -3,
      6,
      -8,
      2
  ],
  "130": [
      -2,
      -6,
      -6,
      7,
      -5,
      1
  ],
  "131": [
      -2,
      -6,
      -5,
      7,
      -6,
      1
  ],
  "132": [
      -2.5,
      -6,
      -4,
      7,
      -7,
      1
  ],
  "133": [
      -1,
      1,
      -3,
      5,
      9,
      3
  ],
  "134": [
      -1,
      1,
      -2,
      5,
      8,
      3
  ],
  "135": [
      -2,
      1,
      -1,
      5,
      7,
      3
  ],
  "136": [
      -1,
      -5,
      -4,
      6,
      8,
      2
  ],
  "137": [
      -1,
      -5,
      -3,
      6,
      7,
      2
  ],
  "138": [
      -2,
      -5,
      -2,
      6,
      6,
      2
  ],
  "139": [
      -5,
      2,
      -5,
      6,
      7,
      8
  ],
  "140": [
      -5,
      2,
      -6,
      6,
      6,
      8
  ],
  "141": [
      -6,
      2,
      -7,
      6,
      5,
      8
  ],
  "142": [
      -6,
      -5,
      -6,
      5,
      6,
      7
  ],
  "143": [
      -6,
      -5,
      -7,
      5,
      5,
      7
  ],
  "144": [
      -7,
      -5,
      -8,
      5,
      4,
      7
  ],
  "145": [
      -9,
      4,
      -7,
      8,
      8,
      10
  ],
  "146": [
      -9,
      4,
      -8,
      8,
      7,
      10
  ],
  "147": [
      -10,
      4,
      -9,
      8,
      6,
      10
  ],
  "148": [
      -8,
      -4,
      -8,
      7,
      7,
      9
  ],
  "149": [
      -8,
      -4,
      -9,
      7,
      6,
      9
  ],
  "150": [
      -9,
      -4,
      -10,
      7,
      5,
      9
  ],
  "151": [
      -8,
      9,
      -8,
      8,
      0,
      9
  ],
  "152": [
      -8,
      9,
      -8,
      8,
      -7,
      9
  ],
  "153": [
      -8,
      9,
      -8,
      8,
      -9,
      9
  ],
  "154": [
      -7,
      6,
      -8,
      8,
      1,
      8
  ],
  "155": [
      -7,
      6,
      -8,
      8,
      -6,
      8
  ],
  "156": [
      -7,
      6,
      -8,
      8,
      -8,
      8
  ],
  "157": [
      -10,
      7,
      -10,
      6,
      0,
      7
  ],
  "158": [
      -10,
      7,
      -10,
      6,
      -2,
      7
  ],
  "159": [
      -10,
      7,
      -10,
      6,
      -4,
      7
  ],
  "160": [
      -9,
      -2,
      -10,
      6,
      -4,
      6
  ],
  "161": [
      -9,
      -2,
      -10,
      6,
      -6,
      6
  ],
  "162": [
      -9,
      -2,
      -10,
      6,
      -8,
      6
  ],
  "163": [
      -9,
      6,
      -9,
      7,
      9,
      8
  ],
  "164": [
      -9,
      6,
      -9,
      7,
      7,
      8
  ],
  "165": [
      -9,
      6,
      -9,
      7,
      0,
      8
  ],
  "166": [
      -8,
      -1,
      -9,
      7,
      9,
      7
  ],
  "167": [
      -8,
      -1,
      -9,
      7,
      7,
      7
  ],
  "168": [
      -8,
      -1,
      -9,
      7,
      0,
      7
  ],
  "169": [
      -7,
      8,
      -7,
      9,
      2,
      10
  ],
  "170": [
      -7,
      8,
      -7,
      9,
      -5,
      10
  ],
  "171": [
      -7,
      8,
      -7,
      9,
      -7,
      10
  ],
  "172": [
      -6,
      4,
      -7,
      9,
      3,
      9
  ],
  "173": [
      -6,
      4,
      -7,
      9,
      -4,
      9
  ],
  "174": [
      -6,
      4,
      -7,
      9,
      -6,
      9
  ],
  "175": [
      -10,
      10,
      -10,
      10,
      9,
      10
  ],
  "176": [
      -10,
      10,
      -10,
      10,
      8,
      10
  ],
  "177": [
      -10,
      10,
      -10,
      10,
      7,
      10
  ],
  "178": [
      -10,
      8,
      -10,
      10,
      9,
      10
  ],
  "179": [
      -10,
      8,
      -10,
      10,
      8,
      10
  ],
  "180": [
      -10,
      8,
      -10,
      10,
      7,
      10
  ]
};

export const allTypeX = [-10, -9, -8, -7, -6, -5, -4, -3.5, -3, -2.5, -2, -1.5, -1, -0.5, 0, 0.5, 1, 1.5, 2, 2.5, 3, 3.5, 4, 5, 6, 7, 8, 9, 10];

export const bgColorMap = {
  老虎: '#E78148',
  豹子: '#FFBC6E',
  鹦鹉: '#D0DF67',
  河马: '#8F7890',
  猴子: '#7C463A',
  大象: '#EADADB',
  牛: '#DDBBBC',
  鹰: '#C24B54',
  松鼠: '#ED5D2B',
  熊猫: '#E8E8EC',
  骆驼: '#E4B88F',
  狐狸: '#FFB661',
  羊: '#F9EAD9',
  鹿: '#B78461',
  驴: '#9994A0',
  犀牛: '#7A7A7B',
  考拉: '#D3D2BA',
  狮子: '#BA6448',
  孔雀: '#19AB96',
  天鹅: '#EEE3F0',
  兔子: '#F2E7EF',
  猫: '#C8C2D8',
  猫头鹰: '#CABFB3',
};

export const animalIntro = {
  老虎: '1.老虎是是魅力四射的领导者与合作者，具领导力与自信，但需避免过度自信导致的问题。\n2.互动时，老虎要开放心态，倾听他言，促和谐关系。\n3.追求目标时，增耐心，减冲动，以理性应对。\n4.交友合作时，需投入时间，深化理解，包容差异，深化倾听，增信任。',
  豹子: '1.豹子是积极而全面的领导者与合作者，展现出积极主动的态度和出众的领导力，能够激励并引领团队向前发展。\n2.为进一步提升，豹子需增强耐心，谦逊地接受他人意见，并重视倾听与沟通的重要性。\n3.在领导力中需平衡控制欲，避免孤立；在沟通与交友中则需找到情感与控制的平衡点。\n4.豹子致力于深化与各方的关系，追求高质量的互动与深刻的理解。\n5.提高对新事物的接纳度和适应能力，保持耐心以应对各种挑战，是实现个人成长的关键。',
  鹦鹉: '1.鹦鹉是阳光热情、多才多艺的领袖与伙伴，在多方面表现积极热情，善于表达和创新，充满感染力和创造力。\n2.为持续发展，鹦鹉需加强情绪管理，保持心态平稳，避免冲动。\n3.追求目标时，鹦鹉应平衡理想与现实，调整期望，务实应对挑战。\n4.鹦鹉在学习、沟通、交友中需深化思考，耐心经营以稳固关系。',
  河马: '1.河马是发展均衡的现实主义者，在思考、学习和处理问题时，能够迅速理清头绪并做出有条理的安排。\n2.无论是在学习、工作还是人际交往中，河马都表现出耐心细致的品质，能够深入探究并专注于当前的任务或目标。\n3.河马能够在处理事务时能有效管理情绪，也擅长在感性与理性之间找到平衡。\n4.在沟通中能够清晰、准确地传达自己的想法，并善于倾听他人的意见。\n5.在交友方面，河马珍视友谊的质量而非数量，愿意耐心经营每一段关系。',
  猴子: '1.猴子是团队中的脑力担当，性格积极，情绪稳定，适应力强，追求高效独立同时保持开放心态，接纳不同意见。\n2.注重情感交流，关心他人需求，以深化人际关系。\n3.在领导、学习与交友中，均展现谦逊态度，持续自我完善。\n4.猴子不仅致力于深化既有关系，还积极拓展新领域，以行动证明价值。',
  大象: '1.大象是全面均衡的领导者与沟通者，情绪稳定，重视自我成长，勇敢追梦。\n2.他们沟通积极开放，注重情感共鸣，直面问题，保持务实。\n3.交友广泛真诚，精选深交，以行动深化友谊。\n4.学习上，探索与实践并重，鼓励创新，专注批判性思维。',
  牛: '1.牛是全能的领导者与行动者，兼具卓越领导力和行动力，目标明确且自信积极。\n2.他们注重灵活性提升，追求各方面平衡，尤其重视情感与人际和谐。\n3.在沟通中开放包容，擅长倾听与情感共鸣，构建良好人际关系。\n4.珍视友情，以情感共鸣深化友谊。\n5.勇于尝试新事物，接纳不同意见，展现出开放心态与进取心。',
  鹰: '1.鹰是独立自信的探索者兼领导者，展现出强烈的自信与领导力，目标明确且行动力十足。\n2.在追求个人成就的同时，他们也懂得平衡团队合作与自主决策，展现出灵活性和包容性。\n3.独立创新的特质使他们在各个领域都能脱颖而出，而开放接纳的心态则让他们不断吸收新知，持续成长。\n4.在人际交往中，他们既是积极的目标导向者，也是深谙情感共鸣的友人，能够用心经营并深化每一段关系。',
  松鼠: '1.松鼠是梦想实践者兼情感共鸣家，他们受梦想驱动，积极进取，同时保持务实态度。\n2.在管理、学习及探索上，展现高效与好奇心。\n3.人际交往中，他们重视情感共鸣，交友审慎而真挚，愿意投入时间深化友谊。\n4.开放心态使他们善于接纳不同意见，灵活应对变化。\n5.他们是勇敢追梦者，也是温暖人心的朋友，用实际行动平衡梦想与现实，展现独特魅力。',
  熊猫: '1.熊猫是梦想热情的平衡者，他们怀揣梦想，热情洋溢，同时在理想与现实间寻找平衡。\n2.人际交往中，他们情感充沛，善于沟通，珍视友谊。\n3.在学习上，他们积极探索，适应变化，注重细节。\n4.他们既热情又理智，既追求梦想又脚踏实地，是不断成长与完善的个体。',
  骆驼: '1.骆驼是全面均衡的领导者与情感智者，他们自信、目标明确，擅长逻辑分析，同时注重情感交流，平衡理性与感性。\n2.在学习和工作中，他们既能独立探索，也擅长团队合作，灵活应对变化。\n3.人际交往中，他们交友稳健，珍视友谊，用关怀和共情深化关系。\n4.他们是值得信赖的领导者，也是温暖人心的朋友，展现了高度的智慧和情感成熟度。',
  狐狸: '1.狐狸是全面发展的领导者与情感探索者，展现出积极主动的领导特质，善于表达和交际，同时具备强大的情绪管理能力和情感智慧。\n2.在追求卓越的道路上，他们懂得平衡自负与控制欲，信任团队，注重合作与沟通。\n3.他们不仅是出色的学习者，追求知识的深度和广度，还勇于创新，敢于挑战未知。\n4.在人际交往中，他们交友广泛，珍视深厚的友谊，并致力于通过共鸣和共识来深化这些关系。',
  羊: '1.羊是热情追梦的情感智者，他们友好热情，富有感染力，勇敢追求梦想，同时情感丰富，擅长人际交往。\n2.作为追梦者，他们坚守自我，脚踏实地；作为情感智者，他们真诚交流，深化友谊。\n3.他们既能独立自信，又能开放包容，在合作与自我发展中找到平衡。\n4.在追求梦想和人际交往的旅途中，他们展现出独特的魅力和智慧。',
  鹿: '1.鹿是“全面发展的社交探索者”，友好热情，善于交际，情感丰富且同理心强。\n2.他们细腻敏感，追求新知，逻辑清晰，同时注重内心平衡与情绪管理。\n3.独立自主，减少对外部认可的依赖，珍视友谊并致力于深化关系。\n4.在适应变化中不断成长，是充满活力与智慧的社交典范。',
  驴: '1.驴是理性独立的目标追求者，擅长逻辑决策，坚定自信，追求目标时展现出强大执行力。\n2.面对挑战，他们灵活适应，保持开放心态，接纳新思维。\n3.交友谨慎而深刻，珍视共鸣，用行动支持友谊。\n4.他们既独立又懂得倾听，是那些以理智为舵，以坚韧为帆，在人生航程中不断探索与成长的个体。',
  犀牛: '1.犀牛是逻辑严谨且执行力强的平衡者，以清晰的思维和果断的行动著称。\n2.在工作与生活中，他们善于平衡理性与情感，创新与实用，确保各方面和谐共进。\n3.目标明确，计划有序，擅长在沟通中既保持效率又倾听他人。\n4.交友谨慎而深刻，重视友谊的质量。\n5.他们是那些能够在复杂环境中找到平衡，以全面视角追求个人成长的杰出个体。',
  考拉: '1.考拉是理性乐观的探索者，他们既拥有理性的思考方式和乐观的生活态度，又充满了好奇心和想象力，对未知世界保持不懈的探索欲。\n2.他们重视情感需求，懂得在理想与现实之间找到平衡，以成熟的心态接受生活的不完美。\n3.在学习和工作中，他们展现出强大的学习能力和创新能力，不断追求个人成长和进步。\n4.在人际交往中，他们谨慎而深刻，珍视长久的友谊，并以开放和真诚的态度与他人建立联系。',
  狮子: '1.狮子是全面均衡的智者，他们自我管理能力强，目标明确且学习深入，沟通逻辑清晰且灵活。\n2.交友谨慎，珍视深刻友谊，并愿意投入实际支持。\n3.他们接受不完美，拥抱变化，展现出强大的适应力和开放心态。\n4.无论是个人成长还是人际交往，他们都能找到最佳平衡点，以智慧和勇气面对生活的挑战。',
  孔雀: '1.孔雀是艺术敏感且均衡的探索者，他们艺术气质浓郁，细腻敏感，富有创新力。\n2.在追求梦想的同时，擅长情绪管理，平衡感性与理性。\n3.交友时，他们珍视深刻友谊，以开放心态和包容态度深化关系。\n4.无论学习、工作还是生活，他们都深思熟虑，追求真实与平衡，展现出全面发展的独特魅力。',
  天鹅: '1.天鹅是情感丰富且理性的艺术探索者，他们拥有浓郁的艺术气质，情感深邃且善于表达。\n2.在感性与理性间游刃有余，能控制情绪，做出明智决策。\n3.同理心强，善于理解他人，交友真诚且持久。\n4.他们不断追求个人成长，通过学习与反思提升自我，展现出均衡发展的独特魅力。',
  兔子: '1.兔子是艺术感性与理性思维并存的探索者，兼具艺术气质与逻辑思维，情感丰富且理性明智。\n2.在人际交往中，展现强同理心，深化情感联系。\n3.勇于探索未知，不畏挑战，持续追求成长。\n4.以开放包容心态面对生活，展现均衡发展的独特魅力。',
  猫: '1.猫是艺术感性与理性并蓄的成长者，他们艺术气质浓厚，情感丰富，同时拥有理性思维，善于平衡感性与理性。\n2.在成长路上，他们注重情绪管理，追求真诚友谊，深化人际关系。\n3.谦逊开放，接纳不同意见，持续学习，勇于挑战自我，不断追求进步与发展。',
  猫头鹰: '1.猫头鹰是哲学家类型，擅长自我思考，思考终极问题。\n2.关注自我，不关注他人，更擅长独立工作。\n3.对外激励不敏感，在乎内心的自我感受。\n4.对客观事物创新态度不积极，对新鲜的哲学领悟充满兴趣。',
};